In [1]:
import pandas as pd

In [2]:
friday= pd.read_csv('friday.csv', sep= ';')

In [3]:
friday.head()

             timestamp  customer_no  location
0  2019-09-06 07:00:00            1     dairy
1  2019-09-06 07:00:00            2    drinks
2  2019-09-06 07:00:00            3     fruit
3  2019-09-06 07:01:00            2  checkout
4  2019-09-06 07:01:00            4    drinks

In [4]:
thursday= pd.read_csv('thursday.csv', sep= ';')

In [5]:
monday= pd.read_csv('monday.csv', sep= ';')

In [6]:
tuesday= pd.read_csv('tuesday.csv', sep= ';')

In [7]:
wednsday= pd.read_csv('wednesday.csv', sep= ';')

In [8]:
monday['customer_number']= monday['customer_no'].apply(lambda x: '{}{}'.format('mon_', x))

In [9]:
monday.head()

             timestamp  customer_no location customer_number
0  2019-09-02 07:03:00            1    dairy           mon_1
1  2019-09-02 07:03:00            2    dairy           mon_2
2  2019-09-02 07:04:00            3    dairy           mon_3
3  2019-09-02 07:04:00            4    dairy           mon_4
4  2019-09-02 07:04:00            5   spices           mon_5

In [10]:
tuesday['customer_number']= tuesday['customer_no'].apply(lambda x: '{}{}'.format('tue_', x))

In [11]:
tuesday.head()

             timestamp  customer_no location customer_number
0  2019-09-03 07:02:00            1    fruit           tue_1
1  2019-09-03 07:02:00            2   drinks           tue_2
2  2019-09-03 07:03:00            3    dairy           tue_3
3  2019-09-03 07:05:00            1   drinks           tue_1
4  2019-09-03 07:06:00            4    dairy           tue_4

In [12]:
friday.index=pd.to_datetime(friday.index)

In [13]:
wednsday.tail()

                timestamp  customer_no  location
5045  2019-09-04 21:48:00         1528    spices
5046  2019-09-04 21:49:00         1520     dairy
5047  2019-09-04 21:49:00         1529     dairy
5048  2019-09-04 21:49:00         1530     fruit
5049  2019-09-04 21:49:00         1531  checkout

In [14]:
thursday['customer_number']= thursday['customer_no'].apply(lambda x: '{}{}'.format('thur_', x))

In [15]:
friday['customer_number']= friday['customer_no'].apply(lambda x: '{}{}'.format('fri_', x))

In [16]:
friday.head()

,timestamp,customer_no,location,customer_number
1970-01-01 00:00:00.000000000,2019-09-06 07:00:00,1,dairy,fri_1
1970-01-01 00:00:00.000000001,2019-09-06 07:00:00,2,drinks,fri_2
1970-01-01 00:00:00.000000002,2019-09-06 07:00:00,3,fruit,fri_3
1970-01-01 00:00:00.000000003,2019-09-06 07:01:00,2,checkout,fri_2
1970-01-01 00:00:00.000000004,2019-09-06 07:01:00,4,drinks,fri_4

In [17]:
#Calculate the total number of customers in each section

In [18]:
fri_location=friday.groupby(['location']).count()

In [19]:
fri_location

          timestamp  customer_no  customer_number
location
checkout       1502         1502             1502
dairy           932          932              932
drinks          844          844              844
fruit          1057         1057             1057
spices          790          790              790

In [20]:
#Calculate the total number of customers in each section over time

friday.head()

,timestamp,customer_no,location,customer_number
1970-01-01 00:00:00.000000000,2019-09-06 07:00:00,1,dairy,fri_1
1970-01-01 00:00:00.000000001,2019-09-06 07:00:00,2,drinks,fri_2
1970-01-01 00:00:00.000000002,2019-09-06 07:00:00,3,fruit,fri_3
1970-01-01 00:00:00.000000003,2019-09-06 07:01:00,2,checkout,fri_2
1970-01-01 00:00:00.000000004,2019-09-06 07:01:00,4,drinks,fri_4

In [21]:
friday=friday.set_index('timestamp')

In [22]:
friday.index=pd.to_datetime(friday.index)

In [23]:
fri_loc_num=friday.groupby(['location']).resample('1H').count()

In [24]:
fri_loc_num.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 75 entries, ('checkout', Timestamp('2019-09-06 07:00:00', freq='H')) to ('spices', Timestamp('2019-09-06 21:00:00', freq='H'))
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_no      75 non-null     int64
 1   location         75 non-null     int64
 2   customer_number  75 non-null     int64
dtypes: int64(3)
memory usage: 2.9+ KB

In [ ]:
#viswa_question nr.

In [ ]:
#viswa_solution